HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxScu_bf.h
/** \\brief  Length for Ifx_SCU_CCUCON3_Bits.PLLSEL */
#define IFX_SCU_CCUCON3_PLLSEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON3_Bits.PLLSEL */
#define IFX_SCU_CCUCON3_PLLSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON3_Bits.PLLSEL */
#define IFX_SCU_CCUCON3_PLLSEL_OFF (6)

/** \\brief  Length for Ifx_SCU_CCUCON3_Bits.SLCK */
#define IFX_SCU_CCUCON3_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON3_Bits.SLCK */
#define IFX_SCU_CCUCON3_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON3_Bits.SLCK */
#define IFX_SCU_CCUCON3_SLCK_OFF (29)

/** \\brief  Length for Ifx_SCU_CCUCON3_Bits.SRIDIV */
#define IFX_SCU_CCUCON3_SRIDIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON3_Bits.SRIDIV */
#define IFX_SCU_CCUCON3_SRIDIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON3_Bits.SRIDIV */
#define IFX_SCU_CCUCON3_SRIDIV_OFF (16)

/** \\brief  Length for Ifx_SCU_CCUCON3_Bits.SRISEL */
#define IFX_SCU_CCUCON3_SRISEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON3_Bits.SRISEL */
#define IFX_SCU_CCUCON3_SRISEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON3_Bits.SRISEL */
#define IFX_SCU_CCUCON3_SRISEL_OFF (22)

/** \\brief  Length for Ifx_SCU_CCUCON3_Bits.UP */
#define IFX_SCU_CCUCON3_UP_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON3_Bits.UP */
#define IFX_SCU_CCUCON3_UP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON3_Bits.UP */
#define IFX_SCU_CCUCON3_UP_OFF (30)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.GTMDIV */
#define IFX_SCU_CCUCON4_GTMDIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.GTMDIV */
#define IFX_SCU_CCUCON4_GTMDIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.GTMDIV */
#define IFX_SCU_CCUCON4_GTMDIV_OFF (8)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.GTMSEL */
#define IFX_SCU_CCUCON4_GTMSEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.GTMSEL */
#define IFX_SCU_CCUCON4_GTMSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.GTMSEL */
#define IFX_SCU_CCUCON4_GTMSEL_OFF (14)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.LCK */
#define IFX_SCU_CCUCON4_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.LCK */
#define IFX_SCU_CCUCON4_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.LCK */
#define IFX_SCU_CCUCON4_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.SLCK */
#define IFX_SCU_CCUCON4_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.SLCK */
#define IFX_SCU_CCUCON4_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.SLCK */
#define IFX_SCU_CCUCON4_SLCK_OFF (29)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.SPBDIV */
#define IFX_SCU_CCUCON4_SPBDIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.SPBDIV */
#define IFX_SCU_CCUCON4_SPBDIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.SPBDIV */
#define IFX_SCU_CCUCON4_SPBDIV_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.SPBSEL */
#define IFX_SCU_CCUCON4_SPBSEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.SPBSEL */
#define IFX_SCU_CCUCON4_SPBSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.SPBSEL */
#define IFX_SCU_CCUCON4_SPBSEL_OFF (6)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.STMDIV */
#define IFX_SCU_CCUCON4_STMDIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.STMDIV */
#define IFX_SCU_CCUCON4_STMDIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.STMDIV */
#define IFX_SCU_CCUCON4_STMDIV_OFF (16)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.STMSEL */
#define IFX_SCU_CCUCON4_STMSEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.STMSEL */
#define IFX_SCU_CCUCON4_STMSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.STMSEL */
#define IFX_SCU_CCUCON4_STMSEL_OFF (22)

/** \\brief  Length for Ifx_SCU_CCUCON4_Bits.UP */
#define IFX_SCU_CCUCON4_UP_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON4_Bits.UP */
#define IFX_SCU_CCUCON4_UP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON4_Bits.UP */
#define IFX_SCU_CCUCON4_UP_OFF (30)

/** \\brief  Length for Ifx_SCU_CCUCON5_Bits.LCK */
#define IFX_SCU_CCUCON5_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON5_Bits.LCK */
#define IFX_SCU_CCUCON5_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON5_Bits.LCK */
#define IFX_SCU_CCUCON5_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_CCUCON5_Bits.MAXDIV */
#define IFX_SCU_CCUCON5_MAXDIV_LEN (4)

/** \\brief  Mask for Ifx_SCU_CCUCON5_Bits.MAXDIV */
#define IFX_SCU_CCUCON5_MAXDIV_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CCUCON5_Bits.MAXDIV */
#define IFX_SCU_CCUCON5_MAXDIV_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCON5_Bits.UP */
#define IFX_SCU_CCUCON5_UP_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON5_Bits.UP */
#define IFX_SCU_CCUCON5_UP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON5_Bits.UP */
#define IFX_SCU_CCUCON5_UP_OFF (30)

/** \\brief  Length for Ifx_SCU_CCUCON6_Bits.CPU0DIV */
#define IFX_SCU_CCUCON6_CPU0DIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON6_Bits.CPU0DIV */
#define IFX_SCU_CCUCON6_CPU0DIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON6_Bits.CPU0DIV */
#define IFX_SCU_CCUCON6_CPU0DIV_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCON7_Bits.CPU1DIV */
#define IFX_SCU_CCUCON7_CPU1DIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON7_Bits.CPU1DIV */
#define IFX_SCU_CCUCON7_CPU1DIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON7_Bits.CPU1DIV */
#define IFX_SCU_CCUCON7_CPU1DIV_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCON9_Bits.ADCDIV */
#define IFX_SCU_CCUCON9_ADCDIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON9_Bits.ADCDIV */
#define IFX_SCU_CCUCON9_ADCDIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON9_Bits.ADCDIV */
#define IFX_SCU_CCUCON9_ADCDIV_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCON9_Bits.ADCSEL */
#define IFX_SCU_CCUCON9_ADCSEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON9_Bits.ADCSEL */
#define IFX_SCU_CCUCON9_ADCSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON9_Bits.ADCSEL */
#define IFX_SCU_CCUCON9_ADCSEL_OFF (6)

/** \\brief  Length for Ifx_SCU_CCUCON9_Bits.LCK */
#define IFX_SCU_CCUCON9_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON9_Bits.LCK */
#define IFX_SCU_CCUCON9_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON9_Bits.LCK */
#define IFX_SCU_CCUCON9_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_CCUCON9_Bits.SLCK */
#define IFX_SCU_CCUCON9_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON9_Bits.SLCK */
#define IFX_SCU_CCUCON9_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON9_Bits.SLCK */
#define IFX_SCU_CCUCON9_SLCK_OFF (29)

